RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW21D5/include/MKW21D5.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define MCG_S_LOLS_MASK                   MCG_S_LOLS0_MASK
#define MCG_S_LOLS_SHIFT                  MCG_S_LOLS0_SHIFT
#define DAC0_IRQn                         This_symbol_has_been_deprecated
#define DAC_DATL_REG(base,index)          This_symbol_has_been_deprecated
#define DAC_DATH_REG(base,index)          This_symbol_has_been_deprecated
#define DAC_SR_REG(base)                  This_symbol_has_been_deprecated
#define DAC_C0_REG(base)                  This_symbol_has_been_deprecated
#define DAC_C1_REG(base)                  This_symbol_has_been_deprecated
#define DAC_C2_REG(base)                  This_symbol_has_been_deprecated
#define DAC_DATL_DATA0_MASK               This_symbol_has_been_deprecated
#define DAC_DATL_DATA0_SHIFT              This_symbol_has_been_deprecated
#define DAC_DATL_DATA0(x)                 This_symbol_has_been_deprecated
#define DAC_DATH_DATA1_MASK               This_symbol_has_been_deprecated
#define DAC_DATH_DATA1_SHIFT              This_symbol_has_been_deprecated
#define DAC_DATH_DATA1(x)                 This_symbol_has_been_deprecated
#define DAC_SR_DACBFRPBF_MASK             This_symbol_has_been_deprecated
#define DAC_SR_DACBFRPBF_SHIFT            This_symbol_has_been_deprecated
#define DAC_SR_DACBFRPTF_MASK             This_symbol_has_been_deprecated
#define DAC_SR_DACBFRPTF_SHIFT            This_symbol_has_been_deprecated
#define DAC_SR_DACBFWMF_MASK              This_symbol_has_been_deprecated
#define DAC_SR_DACBFWMF_SHIFT             This_symbol_has_been_deprecated
#define DAC_C0_DACBBIEN_MASK              This_symbol_has_been_deprecated
#define DAC_C0_DACBBIEN_SHIFT             This_symbol_has_been_deprecated
#define DAC_C0_DACBTIEN_MASK              This_symbol_has_been_deprecated
#define DAC_C0_DACBTIEN_SHIFT             This_symbol_has_been_deprecated
#define DAC_C0_DACBWIEN_MASK              This_symbol_has_been_deprecated
#define DAC_C0_DACBWIEN_SHIFT             This_symbol_has_been_deprecated
#define DAC_C0_LPEN_MASK                  This_symbol_has_been_deprecated
#define DAC_C0_LPEN_SHIFT                 This_symbol_has_been_deprecated
#define DAC_C0_DACSWTRG_MASK              This_symbol_has_been_deprecated
#define DAC_C0_DACSWTRG_SHIFT             This_symbol_has_been_deprecated
#define DAC_C0_DACTRGSEL_MASK             This_symbol_has_been_deprecated
#define DAC_C0_DACTRGSEL_SHIFT            This_symbol_has_been_deprecated
#define DAC_C0_DACRFS_MASK                This_symbol_has_been_deprecated
#define DAC_C0_DACRFS_SHIFT               This_symbol_has_been_deprecated
#define DAC_C0_DACEN_MASK                 This_symbol_has_been_deprecated
#define DAC_C0_DACEN_SHIFT                This_symbol_has_been_deprecated
#define DAC_C1_DACBFEN_MASK               This_symbol_has_been_deprecated
#define DAC_C1_DACBFEN_SHIFT              This_symbol_has_been_deprecated
#define DAC_C1_DACBFMD_MASK               This_symbol_has_been_deprecated
#define DAC_C1_DACBFMD_SHIFT              This_symbol_has_been_deprecated
#define DAC_C1_DACBFMD(x)                 This_symbol_has_been_deprecated
#define DAC_C1_DACBFWM_MASK               This_symbol_has_been_deprecated
#define DAC_C1_DACBFWM_SHIFT              This_symbol_has_been_deprecated
#define DAC_C1_DACBFWM(x)                 This_symbol_has_been_deprecated
#define DAC_C1_DMAEN_MASK                 This_symbol_has_been_deprecated
#define DAC_C1_DMAEN_SHIFT                This_symbol_has_been_deprecated
#define DAC_C2_DACBFUP_MASK               This_symbol_has_been_deprecated
#define DAC_C2_DACBFUP_SHIFT              This_symbol_has_been_deprecated
#define DAC_C2_DACBFUP(x)                 This_symbol_has_been_deprecated
#define DAC_C2_DACBFRP_MASK               This_symbol_has_been_deprecated
#define DAC_C2_DACBFRP_SHIFT              This_symbol_has_been_deprecated
#define DAC_C2_DACBFRP(x)                 This_symbol_has_been_deprecated
#define DAC0_BASE                         This_symbol_has_been_deprecated
#define DAC0                              This_symbol_has_been_deprecated
#define DAC0_BASE_PTR                     This_symbol_has_been_deprecated
#define DAC_BASE_ADDRS                    This_symbol_has_been_deprecated
#define DAC_BASE_PTRS                     This_symbol_has_been_deprecated
#define DAC_IRQS                          This_symbol_has_been_deprecated
#define DAC0_DAT0L                        This_symbol_has_been_deprecated
#define DAC0_DAT0H                        This_symbol_has_been_deprecated
#define DAC0_DAT1L                        This_symbol_has_been_deprecated
#define DAC0_DAT1H                        This_symbol_has_been_deprecated
#define DAC0_DAT2L                        This_symbol_has_been_deprecated
#define DAC0_DAT2H                        This_symbol_has_been_deprecated
#define DAC0_DAT3L                        This_symbol_has_been_deprecated
#define DAC0_DAT3H                        This_symbol_has_been_deprecated
#define DAC0_DAT4L                        This_symbol_has_been_deprecated
#define DAC0_DAT4H                        This_symbol_has_been_deprecated
#define DAC0_DAT5L                        This_symbol_has_been_deprecated
#define DAC0_DAT5H                        This_symbol_has_been_deprecated
#define DAC0_DAT6L                        This_symbol_has_been_deprecated
#define DAC0_DAT6H                        This_symbol_has_been_deprecated
#define DAC0_DAT7L                        This_symbol_has_been_deprecated
#define DAC0_DAT7H                        This_symbol_has_been_deprecated
#define DAC0_DAT8L                        This_symbol_has_been_deprecated
#define DAC0_DAT8H                        This_symbol_has_been_deprecated
#define DAC0_DAT9L                        This_symbol_has_been_deprecated
#define DAC0_DAT9H                        This_symbol_has_been_deprecated
#define DAC0_DAT10L                       This_symbol_has_been_deprecated
#define DAC0_DAT10H                       This_symbol_has_been_deprecated
#define DAC0_DAT11L                       This_symbol_has_been_deprecated
#define DAC0_DAT11H                       This_symbol_has_been_deprecated
#define DAC0_DAT12L                       This_symbol_has_been_deprecated
#define DAC0_DAT12H                       This_symbol_has_been_deprecated
#define DAC0_DAT13L                       This_symbol_has_been_deprecated
#define DAC0_DAT13H                       This_symbol_has_been_deprecated
#define DAC0_DAT14L                       This_symbol_has_been_deprecated
#define DAC0_DAT14H                       This_symbol_has_been_deprecated
#define DAC0_DAT15L                       This_symbol_has_been_deprecated
#define DAC0_DAT15H                       This_symbol_has_been_deprecated
#define DAC0_SR                           This_symbol_has_been_deprecated
#define DAC0_C0                           This_symbol_has_been_deprecated
#define DAC0_C1                           This_symbol_has_been_deprecated
#define DAC0_C2                           This_symbol_has_been_deprecated
#define DAC0_DATL(index)                  This_symbol_has_been_deprecated
#define DAC0_DATH(index)                  This_symbol_has_been_deprecated
#define DMA_EARS_REG(base)                This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_0_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_0_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_1_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_1_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_2_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_2_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_3_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_3_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_4_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_4_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_5_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_5_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_6_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_6_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_7_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_7_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_8_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_8_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_9_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_9_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_10_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_10_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_11_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_11_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_12_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_12_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_13_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_13_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_14_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_14_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_15_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_15_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS                          This_symbol_has_been_deprecated
#define WP7816_T_TYPE0                    WP7816T0
#define WP7816_T_TYPE1                    WP7816T1
#define UART_WP7816_T_TYPE0_REG(base)     UART_WP7816T0_REG(base)
#define UART_WP7816_T_TYPE1_REG(base)     UART_WP7816T1_REG(base)
#define UART_WP7816_T_TYPE0_WI_MASK       UART_WP7816T0_WI_MASK
#define UART_WP7816_T_TYPE0_WI_SHIFT      UART_WP7816T0_WI_SHIFT
#define UART_WP7816_T_TYPE0_WI(X)         UART_WP7816T0_WI(X)
#define UART_WP7816_T_TYPE1_BWI_MASK      UART_WP7816T1_BWI_MASK
#define UART_WP7816_T_TYPE1_BWI_SHIFT     UART_WP7816T1_BWI_SHIFT
#define UART_WP7816_T_TYPE1_BWI(X)        UART_WP7816T1_BWI(X)
#define UART_WP7816_T_TYPE1_CWI_MASK      UART_WP7816T1_CWI_MASK
#define UART_WP7816_T_TYPE1_CWI_SHIFT     UART_WP7816T1_CWI_SHIFT
#define UART_WP7816_T_TYPE1_CWI(X)        UART_WP7816T1_CWI(X)
#define SIM_SOPT1_USBVSTBY_MASK           This_symbol_has_been_deprecated
#define SIM_SOPT1_USBVSTBY_SHIFT          This_symbol_has_been_deprecated
#define SIM_SOPT1_USBSSTBY_MASK           This_symbol_has_been_deprecated
#define SIM_SOPT1_USBSSTBY_SHIFT          This_symbol_has_been_deprecated
#define SIM_SOPT1_USBREGEN_MASK           This_symbol_has_been_deprecated
#define SIM_SOPT1_USBREGEN_SHIFT          This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_URWE_MASK            This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_URWE_SHIFT           This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_UVSWE_MASK           This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_UVSWE_SHIFT          This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_USSWE_MASK           This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_USSWE_SHIFT          This_symbol_has_been_deprecated
#define SIM_SOPT2_USBSRC_MASK             This_symbol_has_been_deprecated
#define SIM_SOPT2_USBSRC_SHIFT            This_symbol_has_been_deprecated
#define SIM_SCGC4_USBOTG_MASK             This_symbol_has_been_deprecated
#define SIM_SCGC4_USBOTG_SHIFT            This_symbol_has_been_deprecated
#define SIM_SCGC6_USBDCD_MASK             This_symbol_has_been_deprecated
#define SIM_SCGC6_USBDCD_SHIFT            This_symbol_has_been_deprecated
#define SIM_CLKDIV2_USBFRAC_MASK          This_symbol_has_been_deprecated
#define SIM_CLKDIV2_USBFRAC_SHIFT         This_symbol_has_been_deprecated
#define SIM_CLKDIV2_USBDIV_MASK           This_symbol_has_been_deprecated
#define SIM_CLKDIV2_USBDIV_SHIFT          This_symbol_has_been_deprecated
#define SIM_CLKDIV2_USBDIV(x)             This_symbol_has_been_deprecated
#define SIM_SCGC6_DAC0_MASK               This_symbol_has_been_deprecated
#define SIM_SCGC6_DAC0_SHIFT              This_symbol_has_been_deprecated
#define Watchdog_IRQn                     WDOG_EWM_IRQn
#define Watchdog_IRQHandler               WDOG_EWM_IRQHandler
#define LPTimer_IRQn                      LPTMR0_IRQn
#define LPTimer_IRQHandler                LPTMR0_IRQHandler
#define LLW_IRQn                          LLWU_IRQn
#define LLW_IRQHandler                    LLWU_IRQHandler

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MKW21D5_H_) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0200u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0200u) */
#endif  /* #if !defined(MKW21D5_H_) */

/* MKW21D5.h, eof. */
